def about():
    return f"""**О чем именно хочешь узнать?**:
` ▶ п!роли - о ролях                      `
` ▶ п!правила - о правилах                `
` ▶ п!модераторы - о модераторах и админах`"""


def roles():
    return f"""**Вот список основных ролей и способы их получения?**:
1) <@&923277518960750702> роль создатель сервера
2) <@&923277518885228563> роль получить нельзя
3) <@&923277518885228562> дается за доверие, может многое но не все. Стравится [M] перед ником
4) <@&923277518885228561> урезанная роль модератора, может чуть меньше. Стравится [-M] перед ником
5) <@&923277518721671280> дается всем, кто нажал на :Dannylogo: в авторизация
6) <@&923277518834905089>, <@&923277518834905090>, <@&923277518834905091>, <@&923277518834905092>, <@&923277518834905093>  роли за уровень в mee6 таблице
7) <@&923277518834905095> дается за топ 1 в таблице mee6
8) <@&923277518784581720> дается за воплощения идей, помощь модерации в исправления ошибок
9) <@&923277518784581721> дается за 10 и больше воплощенных идей сервера, также повышается шанс получить модератора
10) <@&923277518784581719> - нужно быть подписчиком моего канала на ютуб. 
11) <@&923277518834905096> получаете за прохождение сложных демонов (если это экстримы, то прислать пруфы)
12) <@&923277518834905097> получают те у которых есть экстримы на своем GD аккаунте.
13) <@&923277518885228554> - человек помогающий серверу
14) <@&923277518885228555> - человек, внесший огромный вклад в сервер и который помогал ему развиваться
15) <@&923277518784581718> - эту роль получает человек рейдивший мой ютуб канал или дискорд сервер.
16) @everyone - человек, находящийся на сервере
17) <@&923277518885228556> - дается, если нам понравятся ваши работы. Работы кидать в креатор-чат
вы всегда можете найти это сообщение в <#923277519472447535>"""


def channel():
    return f"держи ссылку на канал! https://www.youtube.com/channel/UCyw6JqtwNpk2JIIixW3SbmA"